tests/auto_build/testcases/output/ValidXMLCharIsInterpretedAsCPPCommand_Request.expected

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 632

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test1Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg_name1>1</ns2:arg_name1>
<ns2:arg_name2>2</ns2:arg_name2>
<ns2:arg_name3>3</ns2:arg_name3>
<ns2:arg_name4>4</ns2:arg_name4>
<ns2:arg_name5>5</ns2:arg_name5>
</ns1:Element>
</ns1:test1Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 500

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test2Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg_name1>6</ns2:arg_name1>
</ns1:Element>
</ns1:test2Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 668

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test3Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg_name1>7</ns2:arg_name1>
<ns2:arg_name2>8</ns2:arg_name2>
<ns2:arg_name3>9</ns2:arg_name3>
<ns2:arg_name4>10</ns2:arg_name4>
<ns2:arg_name5>11</ns2:arg_name5>
<ns2:arg_name6>12</ns2:arg_name6>
</ns1:Element>
</ns1:test3Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 677

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test4Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg_name1_>13</ns2:arg_name1_>
<ns2:arg_name2_>14</ns2:arg_name2_>
<ns2:arg_name3_>15</ns2:arg_name3_>
<ns2:arg_name4>16</ns2:arg_name4>
<ns2:arg_name5>17</ns2:arg_name5>
<ns2:arg_name6>18</ns2:arg_name6>
</ns1:Element>
</ns1:test4Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

